---
kind: other
id: Methods.T:Autodesk.Revit.DB.BRepBuilderSurfaceGeometry
source: html/18701fb8-ee8b-b314-bc1b-3134543fdc68.htm
---
# BRepBuilderSurfaceGeometry Methods

Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface, including Plane and CylSurf.